app/views/hours/show.html.erb

  <strong>group:</strong>
  <% if @hour.group.nil? %>
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]