app/views/groups/index.html.erb

  <tbody>
    <% @current_user.group.each do |group| %>
---
SELECT "groups".* FROM "groups"