app/views/groups/show.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---
<div class="media pt-2 pb-2 text-muted bg-white">
    <img src="<%=(url_for(hour.group.icon))%>" alt="" class="ml-2 mr-2 rounded" width="50" height="50"/>