app/helpers/sessions_helper.rb

  def current_user
    @current_user ||= User.find_by_remember_token(cookies[:remember_token])
---
SELECT "users".* FROM "users" WHERE "users"."remember_token" = ? LIMIT ?  [["remember_token", "tTkMERIPSBsLaPjDcLkLWg"], ["LIMIT", 1]]