app/controllers/groups_controller.rb

  def index
    @groups = Group.all
    @index ||= User.find_by_remember_token(cookies[:remember_token])
---
SELECT "groups".* FROM "groups" ORDER BY name ASC
SELECT "users".* FROM "users" WHERE "users"."remember_token" = ? LIMIT ?  [["remember_token", "EkppPcJ56vzNQyMKoK465w"], ["LIMIT", 1]]

  def show
    @hours = Hour.where(group_id: @group.id).order('created_at DESC').includes(:user)
    @hour = @hours.to_a.map { |x| x[:amount] }.sum
---
SELECT "hours".* FROM "hours" WHERE "hours"."group_id" = ? ORDER BY created_at DESC  [["group_id", 15]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 14], ["id", 16]]

  def create
    @group = Group.new(group_params)

    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "amarillo"], ["created_at", "2020-08-18 13:10:27.354410"], ["updated_at", "2020-08-18 13:10:27.354410"]]

  def update
    respond_to do |format|
      if @group.update(group_params)
---
UPDATE "groups" SET "name" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["name", "nom"], ["updated_at", "2020-08-16 07:43:47.504395"], ["id", 15]]