app/controllers/hours_controller.rb

  def index
    @current_user ||= User.find_by_remember_token(cookies[:remember_token])
    @hours = Hour.where(:user_id => @current_user.id).where.not(:group_id => nil).order("created_at DESC").includes(:group)
    @time = @hours.to_a.map{|x| x[:amount]}.sum
---
SELECT "users".* FROM "users" WHERE "users"."remember_token" = ? LIMIT ?  [["remember_token", "dPYrLBbL8AGBCchO2pqUPw"], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" IN (?, ?)  [["id", 16], ["id", 15]]
SELECT "hours"."id" FROM "hours" WHERE "hours"."user_id" = ? AND "hours"."group_id" IS NOT NULL ORDER BY created_at DESC  [["user_id", 14]]
SELECT SUM() FROM "hours" WHERE "hours"."user_id" = ? AND "hours"."group_id" IS NOT NULL  [["user_id", 14]]
SELECT "hours".* FROM "hours" WHERE "hours"."user_id" = ? AND "hours"."group_id" IS NOT NULL ORDER BY created_at DESC  [["user_id", 14]]

  def external
    @current_user ||= User.find_by_remember_token(cookies[:remember_token])
    @hours = Hour.where(:user_id => @current_user.id, :group_id => nil).order("created_at DESC").includes(:group)
    @time = @hours.to_a.map{|x| x[:amount]}.sum
---
SELECT "users".* FROM "users" WHERE "users"."remember_token" = ? LIMIT ?  [["remember_token", "Y62ZTLCvz6IbD13E4nFZHQ"], ["LIMIT", 1]]
SELECT "hours".* FROM "hours" WHERE "hours"."user_id" = ? AND "hours"."group_id" IS NULL ORDER BY created_at DESC  [["user_id", 14]]
SELECT "groups".* FROM "groups"

  def new
    @group_options = Group.all.map{ |u| [ u.name, u.id ] }
---
SELECT "groups".* FROM "groups"

  def create
    @hour = Hour.new(hour_params)
    @current_user ||= User.find_by_remember_token(cookies[:remember_token])
    @hour.user_id = @current_user.id
    @group_options = Group.all.map{ |u| [ u.name, u.id ] }

    respond_to do |format|
      if @hour.save
---
SELECT "users".* FROM "users" WHERE "users"."remember_token" = ? LIMIT ?  [["remember_token", "Y62ZTLCvz6IbD13E4nFZHQ"], ["LIMIT", 1]]
SELECT "groups".* FROM "groups"
INSERT INTO "hours" ("name", "user_id", "amount", "created_at", "updated_at", "group_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "fgb"], ["user_id", 14], ["amount", -2], ["created_at", "2020-08-18 03:08:26.108775"], ["updated_at", "2020-08-18 03:08:26.108775"], ["group_id", 15]]

  def destroy
    @hour.destroy
---
DELETE FROM "hours" WHERE "hours"."id" = ?  [["id", 3]]

    def set_hour
      @hour = Hour.find(params[:id])
---
SELECT "hours".* FROM "hours" WHERE "hours"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]