app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at", "remember_token") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "pok"], ["created_at", "2020-08-18 13:06:23.614363"], ["updated_at", "2020-08-18 13:06:23.614363"], ["remember_token", "lII8u77Dh3vgcSKHZNfSQA"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "name" = ?, "remember_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "rvtl"], ["remember_token", "TvcMVDPD252IZS3_bRmloQ"], ["updated_at", "2020-08-15 23:24:36.820685"], ["id", 14]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)